Revit 2024 API
Toposolid.HostTopoId Property
 The host toposolid id of the current toposolid subdivision. If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ElementId HostTopoId { get; }
Visual Basic
Public ReadOnly Property HostTopoId As ElementId
	Get
Visual C++
public:
property ElementId^ HostTopoId {
	ElementId^ get ();
}
See Also
Toposolid Class
Autodesk.Revit.DB Namespace